#+TITLE:     Home
#+AUTHOR:    David Conner
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes

** Load Path Foreign Distro

On foreign distro, geiser syntax check is looking for patches in =$guix_current=
instead of =$guix_profile=. This is probably left over from when I was messing
with Doom Emacs and Guile in 2023

#+begin_src shell :results output verbatim
guix_current=~/.guix-profile/share/guile/site/3.0/gnu \
guix_profile=~/.config/guix/current/share/guile/site/3.0/gnu

find -L $guix_profile $guix_current \
    -name "u-boot-*.patch" -print | sed -e 's/home\/dc//g' \
    | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── .config
│   └── guix
│       └── current
│           └── share
│               └── guile
│                   └── site
│                       └── 3.0
│                           └── gnu
│                               └── packages
│                                   └── patches
│                                       ├── u-boot-allow-disabling-openssl.patch
│                                       ├── u-boot-nintendo-nes-serial.patch
│                                       └── u-boot-rockchip-inno-usb.patch
└── .guix-profile
    └── share
        └── guile
            └── site
                └── 3.0
                    └── gnu
                        └── packages
                            └── patches
                                ├── u-boot-allow-disabling-openssl.patch
                                ├── u-boot-fix-build-python-3.10.patch
                                ├── u-boot-fix-u-boot-lib-build.patch
                                ├── u-boot-nintendo-nes-serial.patch
                                ├── u-boot-rk3399-enable-emmc-phy.patch
                                ├── u-boot-rockchip-inno-usb.patch
                                └── u-boot-sifive-prevent-reloc-initrd-fdt.patch

19 directories, 10 files
#+end_example



